newaetech/chipwhisperer/firmware/mcu/hal/sam4l/asf/sam4l4/include/component/ast.h
/**
 * \file
 *
 * \brief Component description for AST
 *
 * Copyright (c) 2014 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_AST_COMPONENT_
#define _SAM4L_AST_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR AST */
/* ========================================================================== */
/** \addtogroup SAM4L_AST Asynchronous Timer */
/*@{*/

#define AST_I7532
#define REV_AST                     0x311

/* -------- AST_CR : (AST Offset: 0x00) (R/W 32) Control Register -------- */
#define AST_CR_OFFSET               0x00         /**< \brief (AST_CR offset) Control Register */
#define AST_CR_RESETVALUE           0x00000000   /**< \brief (AST_CR reset_value) Control Register */

#define AST_CR_EN_Pos               0            /**< \brief (AST_CR) Enable */
#define AST_CR_EN                   (0x1u << AST_CR_EN_Pos)
#define   AST_CR_EN_0_Val                 0x0u   /**< \brief (AST_CR) The AST is disabled. */
#define   AST_CR_EN_1_Val                 0x1u   /**< \brief (AST_CR) The AST is enabled */
#define AST_CR_EN_0                 (AST_CR_EN_0_Val               << AST_CR_EN_Pos)
#define AST_CR_EN_1                 (AST_CR_EN_1_Val               << AST_CR_EN_Pos)
#define AST_CR_PCLR_Pos             1            /**< \brief (AST_CR) Prescaler Clear */
#define AST_CR_PCLR                 (0x1u << AST_CR_PCLR_Pos)
#define AST_CR_CAL_Pos              2            /**< \brief (AST_CR) Calendar mode */
#define AST_CR_CAL                  (0x1u << AST_CR_CAL_Pos)
#define AST_CR_CA0_Pos              8            /**< \brief (AST_CR) Clear on Alarm 0 */
#define AST_CR_CA0                  (0x1u << AST_CR_CA0_Pos)
#define AST_CR_CA1_Pos              9            /**< \brief (AST_CR) Clear on Alarm 1 */
#define AST_CR_CA1                  (0x1u << AST_CR_CA1_Pos)
#define AST_CR_PSEL_Pos             16           /**< \brief (AST_CR) Prescaler Select */
#define AST_CR_PSEL_Msk             (0x1Fu << AST_CR_PSEL_Pos)
#define AST_CR_PSEL(value)          ((AST_CR_PSEL_Msk & ((value) << AST_CR_PSEL_Pos)))
#define AST_CR_MASK                 0x001F0307u  /**< \brief (AST_CR) MASK Register */

/* -------- AST_CV : (AST Offset: 0x04) (R/W 32) Counter Value -------- */
#define AST_CV_OFFSET               0x04         /**< \brief (AST_CV offset) Counter Value */
#define AST_CV_RESETVALUE           0x00000000   /**< \brief (AST_CV reset_value) Counter Value */

#define AST_CV_VALUE_Pos            0            /**< \brief (AST_CV) AST Value */
#define AST_CV_VALUE_Msk            (0xFFFFFFFFu << AST_CV_VALUE_Pos)
#define AST_CV_VALUE(value)         ((AST_CV_VALUE_Msk & ((value) << AST_CV_VALUE_Pos)))
#define AST_CV_MASK                 0xFFFFFFFFu  /**< \brief (AST_CV) MASK Register */

/* -------- AST_SR : (AST Offset: 0x08) (R/  32) Status Register -------- */
#define AST_SR_OFFSET               0x08         /**< \brief (AST_SR offset) Status Register */
#define AST_SR_RESETVALUE           0x00000000   /**< \brief (AST_SR reset_value) Status Register */

#define AST_SR_OVF_Pos              0            /**< \brief (AST_SR) Overflow */
#define AST_SR_OVF                  (0x1u << AST_SR_OVF_Pos)
#define AST_SR_ALARM0_Pos           8            /**< \brief (AST_SR) Alarm 0 */
#define AST_SR_ALARM0               (0x1u << AST_SR_ALARM0_Pos)
#define AST_SR_ALARM1_Pos           9            /**< \brief (AST_SR) Alarm 1 */
#define AST_SR_ALARM1               (0x1u << AST_SR_ALARM1_Pos)
#define AST_SR_PER0_Pos             16           /**< \brief (AST_SR) Periodic 0 */
#define AST_SR_PER0                 (0x1u << AST_SR_PER0_Pos)
#define AST_SR_PER1_Pos             17           /**< \brief (AST_SR) Periodic 1 */
#define AST_SR_PER1                 (0x1u << AST_SR_PER1_Pos)
#define AST_SR_BUSY_Pos             24           /**< \brief (AST_SR) AST Busy */
#define AST_SR_BUSY                 (0x1u << AST_SR_BUSY_Pos)
#define   AST_SR_BUSY_0_Val               0x0u   /**< \brief (AST_SR) The AST accepts writes to CV, WER, DTR, SCR, AR, PIR and CR */
#define   AST_SR_BUSY_1_Val               0x1u   /**< \brief (AST_SR) The AST is busy and will discard writes to CV, WER, DTR, SCR, AR, PIR and CR */
#define AST_SR_BUSY_0               (AST_SR_BUSY_0_Val             << AST_SR_BUSY_Pos)
#define AST_SR_BUSY_1               (AST_SR_BUSY_1_Val             << AST_SR_BUSY_Pos)
#define AST_SR_READY_Pos            25           /**< \brief (AST_SR) AST Ready */
#define AST_SR_READY                (0x1u << AST_SR_READY_Pos)
#define AST_SR_CLKBUSY_Pos          28           /**< \brief (AST_SR) Clock Busy */
#define AST_SR_CLKBUSY              (0x1u << AST_SR_CLKBUSY_Pos)
#define   AST_SR_CLKBUSY_0_Val            0x0u   /**< \brief (AST_SR) The clock is ready and can be changed */
#define   AST_SR_CLKBUSY_1_Val            0x1u   /**< \brief (AST_SR) CEN has been written and the clock is busy */
#define AST_SR_CLKBUSY_0            (AST_SR_CLKBUSY_0_Val          << AST_SR_CLKBUSY_Pos)
#define AST_SR_CLKBUSY_1            (AST_SR_CLKBUSY_1_Val          << AST_SR_CLKBUSY_Pos)
#define AST_SR_CLKRDY_Pos           29           /**< \brief (AST_SR) Clock Ready */
#define AST_SR_CLKRDY               (0x1u << AST_SR_CLKRDY_Pos)
#define AST_SR_MASK                 0x33030301u  /**< \brief (AST_SR) MASK Register */

/* -------- AST_SCR : (AST Offset: 0x0C) ( /W 32) Status Clear Register -------- */
#define AST_SCR_OFFSET              0x0C         /**< \brief (AST_SCR offset) Status Clear Register */
#define AST_SCR_RESETVALUE          0x00000000   /**< \brief (AST_SCR reset_value) Status Clear Register */

#define AST_SCR_OVF_Pos             0            /**< \brief (AST_SCR) Overflow */
#define AST_SCR_OVF                 (0x1u << AST_SCR_OVF_Pos)
#define AST_SCR_ALARM0_Pos          8            /**< \brief (AST_SCR) Alarm 0 */
#define AST_SCR_ALARM0              (0x1u << AST_SCR_ALARM0_Pos)
#define AST_SCR_ALARM1_Pos          9            /**< \brief (AST_SCR) Alarm 1 */
#define AST_SCR_ALARM1              (0x1u << AST_SCR_ALARM1_Pos)
#define AST_SCR_PER0_Pos            16           /**< \brief (AST_SCR) Periodic 0 */
#define AST_SCR_PER0                (0x1u << AST_SCR_PER0_Pos)
#define AST_SCR_PER1_Pos            17           /**< \brief (AST_SCR) Periodic 1 */
#define AST_SCR_PER1                (0x1u << AST_SCR_PER1_Pos)
#define AST_SCR_READY_Pos           25           /**< \brief (AST_SCR) AST Ready */
#define AST_SCR_READY               (0x1u << AST_SCR_READY_Pos)
#define AST_SCR_CLKRDY_Pos          29           /**< \brief (AST_SCR) Clock Ready */
#define AST_SCR_CLKRDY              (0x1u << AST_SCR_CLKRDY_Pos)
#define AST_SCR_MASK                0x22030301u  /**< \brief (AST_SCR) MASK Register */

/* -------- AST_IER : (AST Offset: 0x10) ( /W 32) Interrupt Enable Register -------- */
#define AST_IER_OFFSET              0x10         /**< \brief (AST_IER offset) Interrupt Enable Register */
#define AST_IER_RESETVALUE          0x00000000   /**< \brief (AST_IER reset_value) Interrupt Enable Register */

#define AST_IER_OVF_Pos             0            /**< \brief (AST_IER) Overflow */
#define AST_IER_OVF                 (0x1u << AST_IER_OVF_Pos)
#define   AST_IER_OVF_0_Val               0x0u   /**< \brief (AST_IER) No effect */
#define   AST_IER_OVF_1_Val               0x1u   /**< \brief (AST_IER) Enable Interrupt. */
#define AST_IER_OVF_0               (AST_IER_OVF_0_Val             << AST_IER_OVF_Pos)
#define AST_IER_OVF_1               (AST_IER_OVF_1_Val             << AST_IER_OVF_Pos)
#define AST_IER_ALARM0_Pos          8            /**< \brief (AST_IER) Alarm 0 */
#define AST_IER_ALARM0              (0x1u << AST_IER_ALARM0_Pos)
#define   AST_IER_ALARM0_0_Val            0x0u   /**< \brief (AST_IER) No effect */
#define   AST_IER_ALARM0_1_Val            0x1u   /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_ALARM0_0            (AST_IER_ALARM0_0_Val          << AST_IER_ALARM0_Pos)
#define AST_IER_ALARM0_1            (AST_IER_ALARM0_1_Val          << AST_IER_ALARM0_Pos)
#define AST_IER_ALARM1_Pos          9            /**< \brief (AST_IER) Alarm 1 */
#define AST_IER_ALARM1              (0x1u << AST_IER_ALARM1_Pos)
#define   AST_IER_ALARM1_0_Val            0x0u   /**< \brief (AST_IER) No effect */
#define   AST_IER_ALARM1_1_Val            0x1u   /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_ALARM1_0            (AST_IER_ALARM1_0_Val          << AST_IER_ALARM1_Pos)
#define AST_IER_ALARM1_1            (AST_IER_ALARM1_1_Val          << AST_IER_ALARM1_Pos)
#define AST_IER_PER0_Pos            16           /**< \brief (AST_IER) Periodic 0 */
#define AST_IER_PER0                (0x1u << AST_IER_PER0_Pos)
#define   AST_IER_PER0_0_Val              0x0u   /**< \brief (AST_IER) No effect */
#define   AST_IER_PER0_1_Val              0x1u   /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_PER0_0              (AST_IER_PER0_0_Val            << AST_IER_PER0_Pos)
#define AST_IER_PER0_1              (AST_IER_PER0_1_Val            << AST_IER_PER0_Pos)
#define AST_IER_PER1_Pos            17           /**< \brief (AST_IER) Periodic 1 */
#define AST_IER_PER1                (0x1u << AST_IER_PER1_Pos)
#define   AST_IER_PER1_0_Val              0x0u   /**< \brief (AST_IER) No effect */
#define   AST_IER_PER1_1_Val              0x1u   /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_PER1_0              (AST_IER_PER1_0_Val            << AST_IER_PER1_Pos)
#define AST_IER_PER1_1              (AST_IER_PER1_1_Val            << AST_IER_PER1_Pos)
#define AST_IER_READY_Pos           25           /**< \brief (AST_IER) AST Ready */
#define AST_IER_READY               (0x1u << AST_IER_READY_Pos)
#define   AST_IER_READY_0_Val             0x0u   /**< \brief (AST_IER) No effect */
#define   AST_IER_READY_1_Val             0x1u   /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_READY_0             (AST_IER_READY_0_Val           << AST_IER_READY_Pos)
#define AST_IER_READY_1             (AST_IER_READY_1_Val           << AST_IER_READY_Pos)
#define AST_IER_CLKRDY_Pos          29           /**< \brief (AST_IER) Clock Ready */
#define AST_IER_CLKRDY              (0x1u << AST_IER_CLKRDY_Pos)
#define   AST_IER_CLKRDY_0_Val            0x0u   /**< \brief (AST_IER) No effect */
#define   AST_IER_CLKRDY_1_Val            0x1u   /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_CLKRDY_0            (AST_IER_CLKRDY_0_Val          << AST_IER_CLKRDY_Pos)
#define AST_IER_CLKRDY_1            (AST_IER_CLKRDY_1_Val          << AST_IER_CLKRDY_Pos)
#define AST_IER_MASK                0x22030301u  /**< \brief (AST_IER) MASK Register */

/* -------- AST_IDR : (AST Offset: 0x14) ( /W 32) Interrupt Disable Register -------- */
#define AST_IDR_OFFSET              0x14         /**< \brief (AST_IDR offset) Interrupt Disable Register */
#define AST_IDR_RESETVALUE          0x00000000   /**< \brief (AST_IDR reset_value) Interrupt Disable Register */

#define AST_IDR_OVF_Pos             0            /**< \brief (AST_IDR) Overflow */
#define AST_IDR_OVF                 (0x1u << AST_IDR_OVF_Pos)
#define   AST_IDR_OVF_0_Val               0x0u   /**< \brief (AST_IDR) No effect */
#define   AST_IDR_OVF_1_Val               0x1u   /**< \brief (AST_IDR) Disable Interrupt. */
#define AST_IDR_OVF_0               (AST_IDR_OVF_0_Val             << AST_IDR_OVF_Pos)
#define AST_IDR_OVF_1               (AST_IDR_OVF_1_Val             << AST_IDR_OVF_Pos)
#define AST_IDR_ALARM0_Pos          8            /**< \brief (AST_IDR) Alarm 0 */
#define AST_IDR_ALARM0              (0x1u << AST_IDR_ALARM0_Pos)
#define   AST_IDR_ALARM0_0_Val            0x0u   /**< \brief (AST_IDR) No effect */
#define   AST_IDR_ALARM0_1_Val            0x1u   /**< \brief (AST_IDR) Disable interrupt */
#define AST_IDR_ALARM0_0            (AST_IDR_ALARM0_0_Val          << AST_IDR_ALARM0_Pos)
#define AST_IDR_ALARM0_1            (AST_IDR_ALARM0_1_Val          << AST_IDR_ALARM0_Pos)
#define AST_IDR_ALARM1_Pos          9            /**< \brief (AST_IDR) Alarm 1 */
#define AST_IDR_ALARM1              (0x1u << AST_IDR_ALARM1_Pos)
#define   AST_IDR_ALARM1_0_Val            0x0u   /**< \brief (AST_IDR) No effect */
#define   AST_IDR_ALARM1_1_Val            0x1u   /**< \brief (AST_IDR) Disable interrupt */
#define AST_IDR_ALARM1_0            (AST_IDR_ALARM1_0_Val          << AST_IDR_ALARM1_Pos)
#define AST_IDR_ALARM1_1            (AST_IDR_ALARM1_1_Val          << AST_IDR_ALARM1_Pos)
#define AST_IDR_PER0_Pos            16           /**< \brief (AST_IDR) Periodic 0 */
#define AST_IDR_PER0                (0x1u << AST_IDR_PER0_Pos)
#define   AST_IDR_PER0_0_Val              0x0u   /**< \brief (AST_IDR) No effet */
#define   AST_IDR_PER0_1_Val              0x1u   /**< \brief (AST_IDR) Disalbe interrupt */
#define AST_IDR_PER0_0              (AST_IDR_PER0_0_Val            << AST_IDR_PER0_Pos)
#define AST_IDR_PER0_1              (AST_IDR_PER0_1_Val            << AST_IDR_PER0_Pos)
#define AST_IDR_PER1_Pos            17           /**< \brief (AST_IDR) Periodic 1 */
#define AST_IDR_PER1                (0x1u << AST_IDR_PER1_Pos)
#define   AST_IDR_PER1_0_Val              0x0u   /**< \brief (AST_IDR) No effect */
#define   AST_IDR_PER1_1_Val              0x1u   /**< \brief (AST_IDR) Disable interrupt */
#define AST_IDR_PER1_0              (AST_IDR_PER1_0_Val            << AST_IDR_PER1_Pos)
#define AST_IDR_PER1_1              (AST_IDR_PER1_1_Val            << AST_IDR_PER1_Pos)
#define AST_IDR_READY_Pos           25           /**< \brief (AST_IDR) AST Ready */
#define AST_IDR_READY               (0x1u << AST_IDR_READY_Pos)
#define   AST_IDR_READY_0_Val             0x0u   /**< \brief (AST_IDR) No effect */
#define   AST_IDR_READY_1_Val             0x1u   /**< \brief (AST_IDR) Disable interrupt */
#define AST_IDR_READY_0             (AST_IDR_READY_0_Val           << AST_IDR_READY_Pos)
#define AST_IDR_READY_1             (AST_IDR_READY_1_Val           << AST_IDR_READY_Pos)
#define AST_IDR_CLKRDY_Pos          29           /**< \brief (AST_IDR) Clock Ready */
#define AST_IDR_CLKRDY              (0x1u << AST_IDR_CLKRDY_Pos)
#define   AST_IDR_CLKRDY_0_Val            0x0u   /**< \brief (AST_IDR) No effect */
#define   AST_IDR_CLKRDY_1_Val            0x1u   /**< \brief (AST_IDR) Disable interrupt */
#define AST_IDR_CLKRDY_0            (AST_IDR_CLKRDY_0_Val          << AST_IDR_CLKRDY_Pos)
#define AST_IDR_CLKRDY_1            (AST_IDR_CLKRDY_1_Val          << AST_IDR_CLKRDY_Pos)
#define AST_IDR_MASK                0x22030301u  /**< \brief (AST_IDR) MASK Register */

/* -------- AST_IMR : (AST Offset: 0x18) (R/  32) Interrupt Mask Register -------- */
#define AST_IMR_OFFSET              0x18         /**< \brief (AST_IMR offset) Interrupt Mask Register */
#define AST_IMR_RESETVALUE          0x00000000   /**< \brief (AST_IMR reset_value) Interrupt Mask Register */

#define AST_IMR_OVF_Pos             0            /**< \brief (AST_IMR) Overflow */
#define AST_IMR_OVF                 (0x1u << AST_IMR_OVF_Pos)
#define   AST_IMR_OVF_0_Val               0x0u   /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_OVF_1_Val               0x1u   /**< \brief (AST_IMR) Interrupt is enabled. */
#define AST_IMR_OVF_0               (AST_IMR_OVF_0_Val             << AST_IMR_OVF_Pos)
#define AST_IMR_OVF_1               (AST_IMR_OVF_1_Val             << AST_IMR_OVF_Pos)
#define AST_IMR_ALARM0_Pos          8            /**< \brief (AST_IMR) Alarm 0 */
#define AST_IMR_ALARM0              (0x1u << AST_IMR_ALARM0_Pos)
#define   AST_IMR_ALARM0_0_Val            0x0u   /**< \brief (AST_IMR) Interupt is disabled */
#define   AST_IMR_ALARM0_1_Val            0x1u   /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_ALARM0_0            (AST_IMR_ALARM0_0_Val          << AST_IMR_ALARM0_Pos)
#define AST_IMR_ALARM0_1            (AST_IMR_ALARM0_1_Val          << AST_IMR_ALARM0_Pos)
#define AST_IMR_ALARM1_Pos          9            /**< \brief (AST_IMR) Alarm 1 */
#define AST_IMR_ALARM1              (0x1u << AST_IMR_ALARM1_Pos)
#define   AST_IMR_ALARM1_0_Val            0x0u   /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_ALARM1_1_Val            0x1u   /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_ALARM1_0            (AST_IMR_ALARM1_0_Val          << AST_IMR_ALARM1_Pos)
#define AST_IMR_ALARM1_1            (AST_IMR_ALARM1_1_Val          << AST_IMR_ALARM1_Pos)
#define AST_IMR_PER0_Pos            16           /**< \brief (AST_IMR) Periodic 0 */
#define AST_IMR_PER0                (0x1u << AST_IMR_PER0_Pos)
#define   AST_IMR_PER0_0_Val              0x0u   /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_PER0_1_Val              0x1u   /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_PER0_0              (AST_IMR_PER0_0_Val            << AST_IMR_PER0_Pos)
#define AST_IMR_PER0_1              (AST_IMR_PER0_1_Val            << AST_IMR_PER0_Pos)
#define AST_IMR_PER1_Pos            17           /**< \brief (AST_IMR) Periodic 1 */
#define AST_IMR_PER1                (0x1u << AST_IMR_PER1_Pos)
#define   AST_IMR_PER1_0_Val              0x0u   /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_PER1_1_Val              0x1u   /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_PER1_0              (AST_IMR_PER1_0_Val            << AST_IMR_PER1_Pos)
#define AST_IMR_PER1_1              (AST_IMR_PER1_1_Val            << AST_IMR_PER1_Pos)
#define AST_IMR_READY_Pos           25           /**< \brief (AST_IMR) AST Ready */
#define AST_IMR_READY               (0x1u << AST_IMR_READY_Pos)
#define   AST_IMR_READY_0_Val             0x0u   /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_READY_1_Val             0x1u   /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_READY_0             (AST_IMR_READY_0_Val           << AST_IMR_READY_Pos)
#define AST_IMR_READY_1             (AST_IMR_READY_1_Val           << AST_IMR_READY_Pos)
#define AST_IMR_CLKRDY_Pos          29           /**< \brief (AST_IMR) Clock Ready */
#define AST_IMR_CLKRDY              (0x1u << AST_IMR_CLKRDY_Pos)
#define   AST_IMR_CLKRDY_0_Val            0x0u   /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_CLKRDY_1_Val            0x1u   /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_CLKRDY_0            (AST_IMR_CLKRDY_0_Val          << AST_IMR_CLKRDY_Pos)
#define AST_IMR_CLKRDY_1            (AST_IMR_CLKRDY_1_Val          << AST_IMR_CLKRDY_Pos)
#define AST_IMR_MASK                0x22030301u  /**< \brief (AST_IMR) MASK Register */

