newaetech/chipwhisperer/firmware/mcu/hal/sam4l/asf/sam4l4/include/component/ast.h
/* -------- AST_WER : (AST Offset: 0x1C) (R/W 32) Wake Enable Register -------- */
#define AST_WER_OFFSET              0x1C         /**< \brief (AST_WER offset) Wake Enable Register */
#define AST_WER_RESETVALUE          0x00000000   /**< \brief (AST_WER reset_value) Wake Enable Register */

#define AST_WER_OVF_Pos             0            /**< \brief (AST_WER) Overflow */
#define AST_WER_OVF                 (0x1u << AST_WER_OVF_Pos)
#define   AST_WER_OVF_0_Val               0x0u   /**< \brief (AST_WER) The corresponing event will not wake up the CPU from sleep mode */
#define   AST_WER_OVF_1_Val               0x1u   /**< \brief (AST_WER) The corresponding event will wake up the CPU from sleep mode */
#define AST_WER_OVF_0               (AST_WER_OVF_0_Val             << AST_WER_OVF_Pos)
#define AST_WER_OVF_1               (AST_WER_OVF_1_Val             << AST_WER_OVF_Pos)
#define AST_WER_ALARM0_Pos          8            /**< \brief (AST_WER) Alarm 0 */
#define AST_WER_ALARM0              (0x1u << AST_WER_ALARM0_Pos)
#define   AST_WER_ALARM0_0_Val            0x0u   /**< \brief (AST_WER) The corresponing event will not wake up the CPU from sleep mode */
#define   AST_WER_ALARM0_1_Val            0x1u   /**< \brief (AST_WER) The corresponding event will wake up the CPU from sleep mode */
#define AST_WER_ALARM0_0            (AST_WER_ALARM0_0_Val          << AST_WER_ALARM0_Pos)
#define AST_WER_ALARM0_1            (AST_WER_ALARM0_1_Val          << AST_WER_ALARM0_Pos)
#define AST_WER_ALARM1_Pos          9            /**< \brief (AST_WER) Alarm 1 */
#define AST_WER_ALARM1              (0x1u << AST_WER_ALARM1_Pos)
#define   AST_WER_ALARM1_0_Val            0x0u   /**< \brief (AST_WER) The corresponing event will not wake up the CPU from sleep mode */
#define   AST_WER_ALARM1_1_Val            0x1u   /**< \brief (AST_WER) The corresponding event will wake up the CPU from sleep mode */
#define AST_WER_ALARM1_0            (AST_WER_ALARM1_0_Val          << AST_WER_ALARM1_Pos)
#define AST_WER_ALARM1_1            (AST_WER_ALARM1_1_Val          << AST_WER_ALARM1_Pos)
#define AST_WER_PER0_Pos            16           /**< \brief (AST_WER) Periodic 0 */
#define AST_WER_PER0                (0x1u << AST_WER_PER0_Pos)
#define   AST_WER_PER0_0_Val              0x0u   /**< \brief (AST_WER) The corresponing event will not wake up the CPU from sleep mode */
#define   AST_WER_PER0_1_Val              0x1u   /**< \brief (AST_WER) The corresponding event will wake up the CPU from sleep mode */
#define AST_WER_PER0_0              (AST_WER_PER0_0_Val            << AST_WER_PER0_Pos)
#define AST_WER_PER0_1              (AST_WER_PER0_1_Val            << AST_WER_PER0_Pos)
#define AST_WER_PER1_Pos            17           /**< \brief (AST_WER) Periodic 1 */
#define AST_WER_PER1                (0x1u << AST_WER_PER1_Pos)
#define   AST_WER_PER1_0_Val              0x0u   /**< \brief (AST_WER) The corresponing event will not wake up the CPU from sleep mode */
#define   AST_WER_PER1_1_Val              0x1u   /**< \brief (AST_WER) The corresponding event will wake up the CPU from sleep mode */
#define AST_WER_PER1_0              (AST_WER_PER1_0_Val            << AST_WER_PER1_Pos)
#define AST_WER_PER1_1              (AST_WER_PER1_1_Val            << AST_WER_PER1_Pos)
#define AST_WER_MASK                0x00030301u  /**< \brief (AST_WER) MASK Register */

/* -------- AST_AR0 : (AST Offset: 0x20) (R/W 32) Alarm Register 0 -------- */
#define AST_AR0_OFFSET              0x20         /**< \brief (AST_AR0 offset) Alarm Register 0 */
#define AST_AR0_RESETVALUE          0x00000000   /**< \brief (AST_AR0 reset_value) Alarm Register 0 */

#define AST_AR0_VALUE_Pos           0            /**< \brief (AST_AR0) Alarm Value */
#define AST_AR0_VALUE_Msk           (0xFFFFFFFFu << AST_AR0_VALUE_Pos)
#define AST_AR0_VALUE(value)        ((AST_AR0_VALUE_Msk & ((value) << AST_AR0_VALUE_Pos)))
#define AST_AR0_MASK                0xFFFFFFFFu  /**< \brief (AST_AR0) MASK Register */

/* -------- AST_AR1 : (AST Offset: 0x24) (R/W 32) Alarm Register 1 -------- */
#define AST_AR1_OFFSET              0x24         /**< \brief (AST_AR1 offset) Alarm Register 1 */
#define AST_AR1_RESETVALUE          0x00000000   /**< \brief (AST_AR1 reset_value) Alarm Register 1 */

#define AST_AR1_VALUE_Pos           0            /**< \brief (AST_AR1) Alarm Value */
#define AST_AR1_VALUE_Msk           (0xFFFFFFFFu << AST_AR1_VALUE_Pos)
#define AST_AR1_VALUE(value)        ((AST_AR1_VALUE_Msk & ((value) << AST_AR1_VALUE_Pos)))
#define AST_AR1_MASK                0xFFFFFFFFu  /**< \brief (AST_AR1) MASK Register */

/* -------- AST_PIR0 : (AST Offset: 0x30) (R/W 32) Periodic Interval Register 0 -------- */
#define AST_PIR0_OFFSET             0x30         /**< \brief (AST_PIR0 offset) Periodic Interval Register 0 */
#define AST_PIR0_RESETVALUE         0x00000000   /**< \brief (AST_PIR0 reset_value) Periodic Interval Register 0 */

#define AST_PIR0_INSEL_Pos          0            /**< \brief (AST_PIR0) Interval Select */
#define AST_PIR0_INSEL_Msk          (0x1Fu << AST_PIR0_INSEL_Pos)
#define AST_PIR0_INSEL(value)       ((AST_PIR0_INSEL_Msk & ((value) << AST_PIR0_INSEL_Pos)))
#define AST_PIR0_MASK               0x0000001Fu  /**< \brief (AST_PIR0) MASK Register */

/* -------- AST_PIR1 : (AST Offset: 0x34) (R/W 32) Periodic Interval Register 1 -------- */
#define AST_PIR1_OFFSET             0x34         /**< \brief (AST_PIR1 offset) Periodic Interval Register 1 */
#define AST_PIR1_RESETVALUE         0x00000000   /**< \brief (AST_PIR1 reset_value) Periodic Interval Register 1 */

#define AST_PIR1_INSEL_Pos          0            /**< \brief (AST_PIR1) Interval Select */
#define AST_PIR1_INSEL_Msk          (0x1Fu << AST_PIR1_INSEL_Pos)
#define AST_PIR1_INSEL(value)       ((AST_PIR1_INSEL_Msk & ((value) << AST_PIR1_INSEL_Pos)))
#define AST_PIR1_MASK               0x0000001Fu  /**< \brief (AST_PIR1) MASK Register */

/* -------- AST_CLOCK : (AST Offset: 0x40) (R/W 32) Clock Control Register -------- */
#define AST_CLOCK_OFFSET            0x40         /**< \brief (AST_CLOCK offset) Clock Control Register */
#define AST_CLOCK_RESETVALUE        0x00000000   /**< \brief (AST_CLOCK reset_value) Clock Control Register */

